Revit 2024 API
RebarHookType.GetHookExtensionLength Method
 Computes the hook extension length based on current hook length
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double GetHookExtensionLength(
	RebarBarType barType
)
Visual Basic
Public Function GetHookExtensionLength ( _
	barType As RebarBarType _
) As Double
Visual C++
public:
double GetHookExtensionLength(
	RebarBarType^ barType
)
Parameters
barType
Type: Autodesk.Revit.DB.Structure.RebarBarType
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace